[
  {
    "index": 1,
    "title": "Revisiting Manifestos: An Assessment and the Prospects for the Upcoming Indian General Election 2024",
    "link": "https://www.jcoma.com/index.php/JCM/article/view/140",
    "snippet": "… election of 2024 is … India or Clean India campaign, or some other structured campaign by the political parties, the contest would evolve with new issues during the course of the election …",
    "chicago": "Absar, Sana, Ishan Tripathi, and Palwinder Bhatiya. \"Revisiting Manifestos: An Assessment and the Prospects for the Upcoming Indian General Election 2024.\" Journal of Communication and Management 3, no. 01 (2024): 51-58."
  },
  {
    "index": 2,
    "title": "India after the 2024 Elections: Trends and Implications",
    "link": "https://www.ssoar.info/ssoar/handle/document/93848",
    "snippet": "… For example, the 2024 national elections have been preceded by the news of the freezing of the bank accounts of the Indian National Congress (INC), the largest opposition party, and …",
    "chicago": "Duggal, Mahima, Sangeeta Mahapatra, Johannes Plagemann, Adhiraaj Anand, Joachim Betz, and Miriam Prys-Hansen. \"India after the 2024 Elections: Trends and Implications.\" (2024): 12."
  },
  {
    "index": 3,
    "title": "The Leadership Factor in the 2024 Elections: Did Narendra Modi's Impact Peak Much Before the Elections?",
    "link": "https://journals.sagepub.com/doi/abs/10.1177/23210230241289449",
    "snippet": "… is now more visibly apparent in state level elections (Shastri, Kumar, & Sisodia, 2022). This article seeks to use the lens of the 2024 elections to assess the impact of the leadership of …",
    "chicago": "Shastri, Sandeep. \"The Leadership Factor in the 2024 Elections: Did Narendra Modi’s Impact Peak Much Before the Elections?.\" Studies in Indian Politics 12, no. 2 (2024): 265-276."
  },
  {
    "index": 4,
    "title": "Predicting The General Election 2024 Using ML And Data Analytics",
    "link": "https://ieeexplore.ieee.org/abstract/document/10170638/",
    "snippet": "… predict the election results of the 2024 Indian General Elections/Lok Sabha Election which … , etc. using prior election data specific to relevant seats. To reckon emotions important to the …",
    "chicago": "Parida, Pradyumna, Sneha Sinha, Arun Prakash Agrawal, and RaghuRaj Singh Yadav. \"Predicting The General Election 2024 Using ML And Data Analytics.\" In 2023 4th International Conference for Emerging Technology (INCET), pp. 1-9. IEEE, 2023."
  },
  {
    "index": 5,
    "title": "Economic effects of the 2024 US presidential election: sector-wise insights from India",
    "link": "https://www.emerald.com/insight/content/doi/10.1108/JES-11-2024-0765/full/html",
    "snippet": "… This study delves into the short-term Indian stock market responses to the 2024 US presidential election results. Additionally, it examines how these impacts are scattered across …",
    "chicago": "Kumari, Vineeta, Waleed M. Al-ahdal, and Hafiza Aishah Hashim. \"Economic effects of the 2024 US presidential election: sector-wise insights from India.\" Journal of Economic Studies (2025)."
  },
  {
    "index": 6,
    "title": "Retrospective Analysis of the 2024 Indian Elections: BJP Wins the General Elections Against the Strengthening Opposition of the INDIA Bloc",
    "link": "https://www.policycenter.ma/sites/default/files/2024-06/PP_10-24_Jaldi.pdf",
    "snippet": "… India for the next five years, the 2024 election results may usher in a new political cycle of rivalry between the Indian … societal reforms and the new statute of India in the global balances. …",
    "chicago": "Jaldi, Abdessalam Saad. \"Retrospective Analysis of the 2024 Indian Elections: BJP Wins the General Elections Against the Strengthening Opposition of the INDIA Bloc.\" (2024)."
  },
  {
    "index": 7,
    "title": "India's 2024 National Election",
    "link": "https://journals.sagepub.com/doi/abs/10.1177/20419058241282454",
    "snippet": "… Elections to Lok Sabha are normally held every five years based on single member plurality … arrangements by the Election Commission of India (ECI). The 2024 election was conducted …",
    "chicago": "Diwakar, Rekha. \"India’s 2024 National Election.\" Political Insight 15, no. 3 (2024): 18-20."
  },
  {
    "index": 8,
    "title": "PollCast India 2024: Harnessing Data for Accurate Election Predictions",
    "link": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4814788",
    "snippet": "… lead-up to the 2024 elections. This study aims to pioneer a novel approach to election prediction by … This research extends beyond traditional election prediction methodologies to offer a …",
    "chicago": "Bhole, Soham, Deanna Fernandes, Prerna Bajaj, Nishtha Batra, and Abha Tewari. \"PollCast India 2024: Harnessing Data for Accurate Election Predictions.\" Available at SSRN 4814788 (2024)."
  },
  {
    "index": 9,
    "title": "Generative AI and Its Influence on India's 2024 Elections",
    "link": "https://www.freiheit.org/sites/default/files/2025-01/a4_policy-paper_ai-on-indias-2024-electons_en-4.pdf",
    "snippet": "… user base and internet penetration in India, political actors were … been employed in the 2024 Indian general election. Has it … still emerging, the 2024 election highlights critical trends and …",
    "chicago": "Dhanuraj, D., Sreelakshmi Harilal, and Nissy Solomon. \"Generative AI and Its Influence on India’s 2024 Elections.\" (2024)."
  },
  {
    "index": 10,
    "title": "Democracy and the Election Commission of India: 2024 in Review",
    "link": "https://pure.jgu.edu.in/id/eprint/8967/",
    "snippet": "As I write this review on the eve of 2025, much hasn’t changed when it comes to the status of democracy in India. If anything, there are increasing concerns that the gains of democratic …",
    "chicago": "Jain, Anmol. \"Democracy and the Election Commission of India: 2024 in Review.\" Verfassungsblog (2024)."
  },
  {
    "index": 11,
    "title": "Media Strategies in Indian Elections: A Comparative Analysis of'The Hindu'and'Times of India'in 2024",
    "link": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4894771",
    "snippet": "… The role of media strategies in election campaigns has … the 2024 Indian general election through a comparative analysis of two leading newspapers: The Hindu and The Times of India. …",
    "chicago": "Arora, Arshdeep. \"Media Strategies in Indian Elections: A Comparative Analysis of'The Hindu'and'Times of India'in 2024.\" Available at SSRN 4894771 (2024)."
  },
  {
    "index": 12,
    "title": "Challenges and prospects for a united opposition in the 2024 Lok Sabha election in India: an analytical perspective",
    "link": "https://sciresol.s3.us-east-2.amazonaws.com/srs-j/bu_journals/JCP/Vol-3/issue-1/pdf/JCP-2024-3.pdf",
    "snippet": "… in the next Lok Sabha election in 2019 improving its tally of … election, the party has won many state assembly elections … As we approach the 2024 Lok Sabha election, the Congress, the …",
    "chicago": "Diwakar, Rekha. \"Challenges and prospects for a united opposition in the 2024 Lok Sabha election in India: an analytical perspective.\" J. Contemp. Politics 3, no. 1 (2024): 1-9."
  },
  {
    "index": 13,
    "title": "The Changing Face of Indian Elections",
    "link": "https://www.academia.edu/download/117524175/The_Changing_Face_of_Indian_Elections_Notes_on_the_Lok_Sabha_Elections_2024.pdf",
    "snippet": "… elections in India but also as an acknowledgement of the limitations of the above methods. However, unprecedented circumstances during the Lok Sabha elections in 2024 … of elections. …",
    "chicago": "Quadri, Imtiaz. \"The Changing Face of Indian Elections.\" Economic & Political Weekly 59, no. 32 (2024): 11."
  },
  {
    "index": 14,
    "title": "News Article Analysis for Indian Election 2024",
    "link": "https://norma.ncirl.ie/id/eprint/7274",
    "snippet": "… my Indian Election 2024 project on how news items affect public perception and election … This project, designed for the Indian Elections 2024, will provide crucial election data for …",
    "chicago": "Singh, Utkarsh. \"News Article Analysis for Indian Election 2024.\" PhD diss., Dublin, National College of Ireland, 2023."
  },
  {
    "index": 15,
    "title": "General Election 2024: Quo Vadis India?",
    "link": "https://www.thehinducentre.com/the-arena/current-issues/68100834-General-Election-2024-Quo-Vadis-India.pdf",
    "snippet": "… Indian National Congress (INC), even if its pan-India presence receded after the 4th LS and State Elections … India’s quasi-federal structure and diversity). The undercurrents that tugged …",
    "chicago": "Maiorano, Diego. \"General Election 2024: Quo Vadis India?.\""
  },
  {
    "index": 16,
    "title": "For'INDIA'and BJP, 2024 election merits deeper reflection on Indian economy",
    "link": "https://pure.jgu.edu.in/id/eprint/6582/1/thequint.com-For%20INDIA%20and%20BJP%202024%20Election%20Merits%20Deeper%20Reflection%20on%20Indian%20Economy.pdf",
    "snippet": "… Decoupling efforts by foreign investors and firms from China did offer a bleak potential for many to invest in the growing potential of the Indian market, however, not all has been going …",
    "chicago": "Mohan, Deepanshu. \"For'INDIA'and BJP, 2024 election merits deeper reflection on Indian economy.\" The Quint (2023)."
  },
  {
    "index": 17,
    "title": "Challenges and Prospects f or A United Opposition int he 2024 Lok Sabha Election in India: An Analytical Perspective",
    "link": "https://sciresol.s3.us-east-2.amazonaws.com/srs-j/bu_journals/JCP/Vol-3/issue-1/html/JCP-2024-3.html",
    "snippet": "… in the next Lok Sabha election in 2019 improving its tally of … election, the party has won many state assembly elections … As we approach the 2024 Lok Sabha election, the Congress, the …",
    "chicago": "Diwakar, Rekha. \"Challenges and Prospects f or A United Opposition int he 2024 Lok Sabha Election in India: An Analytical Perspective.\" Journal of Contemporary Politics 3, no. 1: 1."
  },
  {
    "index": 18,
    "title": "India's election upset: What next!",
    "link": "https://www.tandfonline.com/doi/abs/10.1080/14781158.2024.2382686",
    "snippet": "… The surprising result of India’s 2024 election has reaffirmed the unpredictable nature of Indian … The BJP's power proving to leverage India's rising global status and Hindu nationalist …",
    "chicago": "Azam, Aizah, and Aarish U. Khan. \"India’s election upset: What next!.\" Global Change, Peace & Security 34, no. 2-3 (2022): 187-191."
  },
  {
    "index": 19,
    "title": "The role of new media in the 2024 general election campaign",
    "link": "https://www.researchgate.net/profile/Chander-Shekhar-10/publication/389026507_The_Role_of_New_Media_in_the_2024_General_Election_Campaign/links/67b0b6178311ce680c641e97/The-Role-of-New-Media-in-the-2024-General-Election-Campaign.pdf",
    "snippet": "… to voters in India's small towns and cities (Ramachandran, 2023). Political parties in India are … to convince voters ahead of the union elections in 2024. The Bharatiya Janata Party, led by …",
    "chicago": "Shekhar, Chander. \"The role of new media in the 2024 general election campaign.\" International Journal For Multidisciplinary Research 6, no. 1 (2024)."
  },
  {
    "index": 20,
    "title": "The Use of Religion Online by Indian Political Entities During the 2024 Lok Sabha Election: Religiopolitical Propaganda on Social Media?",
    "link": "https://journals.sagepub.com/doi/abs/10.1177/08944393251319740",
    "snippet": "… platforms for religiopolitical purposes during elections in India is yet to be fully explored. … on the 2024 Indian General (Lok Sabha) Election. Given Facebook’s large user base in India, …",
    "chicago": "Noman, Mridha Md Shiblee, and Md Sayeed Al-Zaman. \"The Use of Religion Online by Indian Political Entities During the 2024 Lok Sabha Election: Religiopolitical Propaganda on Social Media?.\" Social Science Computer Review (2025): 08944393251319740."
  },
  {
    "index": 21,
    "title": "Haryana Vidhan Sabha Election 2024: Explaining the Verdict",
    "link": "https://knowledgeableresearch.com/index.php/1/article/view/417",
    "snippet": "… Even though the 2024 Lok Sabha election results took some sheen off the Brand Modi, the Haryana election results have shown that PM is the tallest political leader in India with mass …",
    "chicago": "Kharb, Sunil Devi. \"Haryana Vidhan Sabha Election 2024: Explaining the Verdict.\" Knowledgeable Research A Multidisciplinary Journal 4, no. 04 (2025): 50-69."
  },
  {
    "index": 22,
    "title": "Indian National Congress Failed to Revive Itself in General Elections 2024",
    "link": "https://www.researchgate.net/profile/Praveen-Rai-7/publication/386111784_Indian_National_Congress_Failed_to_Revive_Itself_in_General_Elections_2024/links/67455429b5bd9d17d608684f/Indian-National-Congress-Failed-to-Revive-Itself-in-General-Elections-2024.pdf",
    "snippet": "… The General Elections 2024 miraculously halted the declining political graph of the Indian … led by Rahul Gandhi), had an erratic panIndian electoral impact; as a result, it partly reclaimed …",
    "chicago": "Rai, Praveen. \"Indian National Congress Failed to Revive Itself in General Elections 2024.\""
  },
  {
    "index": 23,
    "title": "Understanding India's 18th Lok Sabha Election Outcome",
    "link": "https://journals.sagepub.com/doi/abs/10.1177/23210230241294260",
    "snippet": "… showing signs of a more competitive election, the 2024 election was keenly watched for the … election did prove to be far more competitive than the previous two parliamentary elections. …",
    "chicago": "Palshikar, Suhas. \"Understanding India’s 18th Lok Sabha Election Outcome.\" Studies in Indian Politics 12, no. 2 (2024): 204-207."
  },
  {
    "index": 24,
    "title": "Pocketbook Voting in India's 18th Parliamentary Elections (2024)",
    "link": "https://journals.sagepub.com/doi/abs/10.1177/23210230241289454",
    "snippet": "… is focused on 2014 and 2019 elections. Against this backdrop, … perception on their electoral choice in 2024 LS elections. … people’s) view of the economy prior to the 2024 LS elections. …",
    "chicago": "Alam, Mohd Sanjeer. \"Pocketbook Voting in India’s 18th Parliamentary Elections (2024).\" Studies in Indian Politics 12, no. 2 (2024): 251-264."
  },
  {
    "index": 25,
    "title": "Global Stock Market Reactions to 2024 US Presidential Election Probabilities",
    "link": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5239087",
    "snippet": "… With an eye toward the 2024 election cycle, this study offers a thorough analysis of how daily variations in US presidential election win probabilities affect world equities returns. Using …",
    "chicago": "Kumar Jaiswal, Sourav, Siddharth Singh, Shubhankar Arya, Manoj Das, and Sandeep Singh. \"Global Stock Market Reactions to 2024 US Presidential Election Probabilities.\" Available at SSRN 5239087 (2025)."
  },
  {
    "index": 26,
    "title": "Elections in India",
    "link": "https://books.google.com/books?hl=en&lr=&id=DHoVEQAAQBAJ&oi=fnd&pg=PA143&dq=2024+India+election&ots=e9XT_gLDYB&sig=SvY6mgnjL9P3rLDCZhUBO3YQ11w",
    "snippet": "… in Indian elections who take their voting decision at the last moment. With the sharper ideological divide of voters on party lines, the proportion of floating voters in Indian elections has …",
    "chicago": "Kumar, Sanjay. \"Elections in India.\" The Oxford Handbook of Indian Politics (2024): 143."
  },
  {
    "index": 27,
    "title": "Foreign Policy Issues in the BJP 2024 Election Campaign: Boosting National Pride and Glorifying a Strong Government",
    "link": "https://policycommons.net/artifacts/12522606/foreign-policy-issues-in-the-bjp-2024-election-campaign/13423530/",
    "snippet": "… election campaigns in India traditionally focus on domestic issues above all, the Bharatiya Janata Party’s (BJP) campaign for the 2024 general elections … Modi, India has strengthened its …",
    "chicago": "Saint-Mézard, Isabelle. \"Foreign Policy Issues in the BJP 2024 Election Campaign: Boosting National Pride and Glorifying a Strong Government.\" (2024)."
  },
  {
    "index": 28,
    "title": "Korea-India Economic Cooperation after India's 2024 General Election",
    "link": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4887988",
    "snippet": "… India's 2024 general election came to a close on 4 June with … the second prime minister in Indian history after Jawaharlal … solid economic growth and raised India's international profile. …",
    "chicago": "Kim, Jeong-Gon. \"Korea-India Economic Cooperation after India’s 2024 General Election.\" KIEP Research Paper, KIEP Opinions 292 (2024)."
  },
  {
    "index": 29,
    "title": "Technology and Election",
    "link": "https://search.proquest.com/openview/d9f1c9e81f33779ebe1e3d65feccda79/1?pq-origsite=gscholar&cbl=556342",
    "snippet": "… Lately, World Economic Forum (WEF), warned in its Global Risks Report 2024, that “… also have deep impact on election process and results of Indian General Election 2024. …",
    "chicago": "Bano, Ansari Naseem. \"Technology and Election.\" Researchers World 15, no. 2 (2024): 54-59."
  },
  {
    "index": 30,
    "title": "The 2024 Parliamentary Elections and Punjab Politics: Commonalities, Exceptionalism, and Takeaways.",
    "link": "https://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=09715223&AN=182888443&h=la6wqPb8kwZTzT6Xn8My5qPMKcd7UazyH4XYk1LYL8MwhHMjyxAZh8xnUbC2WGB2Ye79JNEGPX15LOww5EJX8A%3D%3D&crl=c",
    "snippet": "… Union, especially its electoral aspect, with focus on the 2024 Lok Sabha elections. The … other Indian states. The article further discusses the recent 2024 parliamentary elections results …",
    "chicago": "Kumar, Ashutosh. \"The 2024 Parliamentary Elections and Punjab Politics: Commonalities, Exceptionalism, and Takeaways.\" Journal of Sikh & Punjab Studies 31 (2024)."
  },
  {
    "index": 31,
    "title": "US Elections 2024: Polarisation, Key Issues and Impact on the World.",
    "link": "https://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=25819658&AN=183593823&h=zbBaM7SmGDmlUcRSg%2FhJplulYaSg5u6VdOvTf%2B2m%2BNDia6bpJwTxWh1Svlgjpy0YUKjkxjSL%2FSU%2F8b7lPrAdsA%3D%3D&crl=c",
    "snippet": "… The 2024 election results are unlikely to upset the positive relationship between India and the … However, despite the emphasis on the Indo-Pacific strategy and the recognition of India as …",
    "chicago": "Vijayalakshmi, K. P. \"US Elections 2024: Polarisation, Key Issues and Impact on the World.\" National Security (2581-9658) 7, no. 3 (2024)."
  },
  {
    "index": 32,
    "title": "Capital Market Reactions to the Indian Lok Sabha Elections–An Analysis of 2014, 2019 and 2024",
    "link": "http://economic-sciences.com/index.php/journal/article/view/147",
    "snippet": "… Indian Lok Sabha elections on the capital market, focusing on the three electoral cycles ie 2014, 2019, and 2024… The results highlight significant market reactions during election periods…",
    "chicago": "Jain, Puneet, and Anu Gupta. \"Capital Market Reactions to the Indian Lok Sabha Elections–An Analysis of 2014, 2019 and 2024.\" Economic Sciences 21, no. 1 (2025): 205-215."
  },
  {
    "index": 33,
    "title": "Youth Vote in 2024 Lok Sabha Elections",
    "link": "https://journals.sagepub.com/doi/abs/10.1177/23210230241289582",
    "snippet": "… political participation of youth in 2024 Lok Sabha elections and focuses on the … 2024 elections, focusing on the central question: Is the youth still attracted to the BJP in the 2024 elections…",
    "chicago": "Kumar, Sanjay, and Devesh Kumar. \"Youth Vote in 2024 Lok Sabha Elections.\" Studies in Indian Politics 12, no. 2 (2024): 277-288."
  },
  {
    "index": 34,
    "title": "Unpacking Public Satisfaction: An Analysis of the 2024 Lok Sabha Elections",
    "link": "https://journals.sagepub.com/doi/abs/10.1177/23210230241293225",
    "snippet": "… Election Study 2024, conducted among 19,663 respondents across 191 parliamentary constituencies in 23 Indian … In the 2024 Lok Sabha elections, more than six in 10 voters indicated …",
    "chicago": "Attri, Vibha, and Jyoti Mishra. \"Unpacking Public Satisfaction: An Analysis of the 2024 Lok Sabha Elections.\" Studies in Indian Politics 12, no. 2 (2024): 318-335."
  },
  {
    "index": 35,
    "title": "Contesting the Nation: Rhetorical Strategies and Myth-Symbol Complexes in BJP-led NDA and Congress-led INDIA Bloc Speeches, 2024 Indian Elections",
    "link": "https://research-information.bris.ac.uk/en/publications/contesting-the-nation-rhetorical-strategies-and-myth-symbol-compl",
    "snippet": "… Ultimately, this study underscores the 2024 elections as a crucible for India’s national identity, where the ‘idea of the nation’ remains a contentious, evolving construct, shaped by …",
    "chicago": "Darsan, Deva. \"Contesting the Nation: Rhetorical Strategies and Myth-Symbol Complexes in BJP-led NDA and Congress-led INDIA Bloc Speeches, 2024 Indian Elections.\" (2025)."
  },
  {
    "index": 36,
    "title": "India 2023: Towards the general elections amid rising social tension",
    "link": "https://unora.unior.it/bitstream/11574/233701/1/13-AM2023-India-Domestic-1.pdf",
    "snippet": "In 2023, India’s political parties started preparations ahead of the 2024 general elections. The … monopoly of India’s political scene. Particularly important was the year-long spectacle of …",
    "chicago": "Maiorano, Diego. \"India 2023: Towards the general elections amid rising social tension.\" Asia Maior 34, no. 1 (2024): 259-300."
  },
  {
    "index": 37,
    "title": "Lok Sabha Elections 2024-Votes polled and counted in all the parliamentary constituencies-Votes counted more than votes polled",
    "link": "https://policycommons.net/artifacts/15432424/lok-sabha-elections-2024/16326091/",
    "snippet": "… Lok Sabha Elections 2024 - Votes polled and counted in all the parliamentary constituencies - Votes counted more than votes polled 29 Jul 2024 … Published in India …",
    "chicago": "Moni, Navin. \"Lok Sabha Elections 2024-Votes polled and counted in all the parliamentary constituencies-Votes counted more than votes polled.\" (2024)."
  },
  {
    "index": 38,
    "title": "MATURE VERDICT: FOCUS ON ISSUES AND CHALLENGES IN 2024 LOKSABHA ELECTIONS",
    "link": "https://www.researchgate.net/profile/Rajan-Yadav-11/publication/389490504_MATURE_VERDICT_FOCUS_ON_ISSUES_AND_CHALLENGES_IN_2024_LOKSABHA_ELECTIONS/links/67c3cdcc8311ce680c793795/MATURE-VERDICT-FOCUS-ON-ISSUES-AND-CHALLENGES-IN-2024-LOKSABHA-ELECTIONS.pdf",
    "snippet": "… Indian politics is not untouched by this. In the context of the 2024 general elections, we will discuss the problems and challenges that have come up or are emerging in new ways. …",
    "chicago": "Ray, Ajin, and Mr Rajan Yadav. \"MATURE VERDICT: FOCUS ON ISSUES AND CHALLENGES IN 2024 LOKSABHA ELECTIONS.\""
  },
  {
    "index": 39,
    "title": "Markov Chain and Data Analysis on Elections in India",
    "link": "https://ieeexplore.ieee.org/abstract/document/10638403/",
    "snippet": "… and Markov chains applied to Indian election data. The study intends … Indian democracy. The study offers a data-driven forecast of the electoral environment for the next election in 2024 …",
    "chicago": "Swarnakar, Jinal, Richa Sharma, and Gireesh Kumar. \"Markov Chain and Data Analysis on Elections in India.\" In 2024 3rd International Conference on Computational Modelling, Simulation and Optimization (ICCMSO), pp. 261-267. IEEE, 2024."
  },
  {
    "index": 40,
    "title": "Digital Democracy: Social Media's Role in the 2024 Indian Elections–Srishti Ganguly",
    "link": "https://doingsociology.org/2024/09/19/digital-democracy-social-medias-role-in-the-2024-indian-elections-srishti-ganguly/",
    "snippet": "… as we look at the role of digital media in the 2024 elections. … which my observations on the 2024 elections can be read. … on the Indian parliamentary elections of 2024 and changed the …",
    "chicago": "Jitu, By. \"Digital Democracy: Social Media’s Role in the 2024 Indian Elections–Srishti Ganguly.\""
  },
  {
    "index": 41,
    "title": "Social Media Sentiment as an Indicator of Electoral Outcomes: A Study of Indian General Elections",
    "link": "https://ieeexplore.ieee.org/abstract/document/10940718/",
    "snippet": "… This study targets the 2019 and 2024 Indian general elections, which featured prominent political figures Narendra Modi and Rahul Gandhi, to quantitatively assess public sentiment …",
    "chicago": "Arya, Swati, Amit Agarwal, Anshul Lakhera, Uday Sharma, Chitra Jain, and Ankush Mittal. \"Social Media Sentiment as an Indicator of Electoral Outcomes: A Study of Indian General Elections.\" In 2025 International Conference on Pervasive Computational Technologies (ICPCT), pp. 634-638. IEEE, 2025."
  },
  {
    "index": 42,
    "title": "Religion, identity politics and parliamentary elections in India",
    "link": "https://aseestant.ceon.rs/index.php/polrev/issue/download/1948/186#page=189",
    "snippet": "… This paper analyses the religious identity politics that shaped the 2024 general elections in India. In a country with vast ethnic, religious, and cultural differences, identity politics play a …",
    "chicago": "Djogatović, Veljko M. \"Religion, identity politics and parliamentary elections in India.\" ПОЛИТИЧКА РЕВИЈА (2025): 188."
  },
  {
    "index": 43,
    "title": "One Nation One Election through the Federal Lens: An Analysis of the 2024 Ram Nath Kovind Panel Report",
    "link": "https://heinonline.org/hol-cgi-bin/get_pdf.cgi?handle=hein.journals/ijlmhs29&section=160",
    "snippet": "… India's elections are directed and controlled by the Election Commission of India4. … elections in the election cycle of 2019 and the rest of the states having elections in the 2024 cycle. . …",
    "chicago": "Maurya, Hiya, and Annette Sara Abraham. \"One Nation One Election through the Federal Lens: An Analysis of the 2024 Ram Nath Kovind Panel Report.\" Issue 3 Int'l JL Mgmt. & Human. 7 (2024): 2354."
  },
  {
    "index": 44,
    "title": "Issues and Trends in US Presidential Election 2024",
    "link": "https://isdp.eu/wp-content/uploads/2024/03/Brief-Monish-Mar-14-2024-final.pdf",
    "snippet": "… yet again become a focal point in 2024.Joe Biden fought the 2020 election taking the opposite spectrum of … He is a regular commentator on international affairs and Indian foreign policy. …",
    "chicago": "Tourangbam, Monish. \"Issues and Trends in US Presidential Election 2024.\" Institute for Security and Development Policy [issue brief] (2024)."
  },
  {
    "index": 45,
    "title": "The Elections of 2024",
    "link": "https://books.google.com/books?hl=en&lr=&id=WjRcEQAAQBAJ&oi=fnd&pg=PT5&dq=2024+India+election&ots=FKO-QMh77Z&sig=64g1qPc0NYev4pcbteqfTx-5e5k",
    "snippet": "… the qualifications clause were felt in every election from 2012 to 2024. Trump rose to national … selection.12 Harris's Jamaican father and Indian mother were working in California when …",
    "chicago": "Nelson, Michael, ed. The Elections of 2024. University of Virginia Press, 2025."
  },
  {
    "index": 46,
    "title": "NAVIGATING'SHARP POWER': BUILDING DEMOCRATIC RESILIENCE THROUGH MEDIA LITERACY FOR INDIA'S ELECTIONS IN 2024",
    "link": "https://www.ceeol.com/content-files/document-1225824.pdf#page=67",
    "snippet": "… In conclusion, as India prepares for its 2024 general elections, it confronts the challenge of preserving the integrity of its democratic process in the face of potential interference from “…",
    "chicago": "Tripathi, Durgesh, and Surbhi Tandon. \"NAVIGATING'SHARP POWER': BUILDING DEMOCRATIC RESILIENCE THROUGH MEDIA LITERACY FOR INDIA'S ELECTIONS IN 2024.\" In Social Discourse in Challenging Times The International Interdisciplinary Scientific Conference 2023 Proceedings and Book of Abstracts, p. 61. 2023."
  },
  {
    "index": 47,
    "title": "Global Market Reactions to 2024 US Presidential Election Uncertainty Based on Betting Market: An Investigation of Investor Sentiment and Policy Expectations",
    "link": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5236959",
    "snippet": "… of Trump winning the US elections had positively impacted the Indian stock market. Similarly, if the … of Trump winning the US elections had negatively impacted the Indian stock market. …",
    "chicago": "Puitandy, Shibam, Surajkumar Suntha, Varun Chauhan, Tarun Kumar, and Pranshu Verma. \"Global Market Reactions to 2024 US Presidential Election Uncertainty Based on Betting Market: An Investigation of Investor Sentiment and Policy Expectations.\" Available at SSRN 5236959 (2025)."
  },
  {
    "index": 48,
    "title": "AI-generated misinformation in the election year 2024: measures of European Union",
    "link": "https://www.frontiersin.org/journals/political-science/articles/10.3389/fpos.2024.1451601/full",
    "snippet": "… was vibrant when the elections were held in the largest democracy India, in May–June 2024. Disinformation and Misinformation also posed many challenges in the elections in India. AI-…",
    "chicago": "Shukla, Aditya Kumar, and Shraddha Tripathi. \"AI-generated misinformation in the election year 2024: measures of European Union.\" Frontiers in Political Science 6 (2024): 1451601."
  },
  {
    "index": 49,
    "title": "Updated-Analysis of Criminal, Financial and other Details of Candidates Lok Sabha Elections 2024 Phase I. Ver2. English",
    "link": "https://policycommons.net/artifacts/16302337/updated-analysis-of-criminal-financial-and-other-details-of-candidates-lok-sabha-elections-2024-phase-i/17187019/",
    "snippet": "Candidates' affidavits obtained from the ECI website (www.eci.nic.in) with nomination papers is the source of this analysis. [...] Candidates' affidavits obtained from the ECI website (www.…",
    "chicago": "Moni, Navin. \"Updated-Analysis of Criminal, Financial and other Details of Candidates Lok Sabha Elections 2024 Phase I. Ver2. English.\" (2024)."
  },
  {
    "index": 50,
    "title": "Opinion| What We Learned from Lok Sabha Elections 2024",
    "link": "https://pure.jgu.edu.in/id/eprint/7979/",
    "snippet": "… time in a closely contested election, some takeaways from this election seem important. … loom large in Indian politics. The politicians seem to have realised that the Indian people are yet …",
    "chicago": "Batra, Jagdish. \"Opinion| What We Learned from Lok Sabha Elections 2024.\" MSN-News18 (2024)."
  }
]